//Напишите программу, которая выводит строку «Hello World!» в консоль.
public class Task1 {
    public static void main(String[] args) {
        System.out.print("Hello World!");
    }
}
